app/controllers/countries_controller.rb

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_country
      @country = Country.find(params[:id])