app/controllers/hobbies_controller.rb

SELECT "hobbies".* FROM "hobbies"
---
  def index
    @hobbies = Hobby.all