app/controllers/users_controller.rb

  def index
    @users = User.joins(:country).collect { |user| user.country.attributes.merge(user.attributes).merge({hobbies_attributes: user.user_hobbies}) }
---
SELECT "hobbies".* FROM "hobbies" INNER JOIN "users_hobbies" ON "hobbies"."id" = "users_hobbies"."hobby_id" WHERE "users_hobbies"."user_id" = $1  [["user_id", 40]]
SELECT "users".* FROM "users" INNER JOIN "users_hobbies" ON "users_hobbies"."user_id" = "users"."id" INNER JOIN "hobbies" ON "hobbies"."id" = "users_hobbies"."hobby_id"

  def create
    @user = User.new(user_params)
    # byebug
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "age", "gender", "created_at", "updated_at", "country_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["first_name", "alex"], ["last_name", "pashchenko"], ["age", 21], ["gender", "male"], ["created_at", 2017-08-28 09:33:37 UTC], ["updated_at", 2017-08-28 09:33:37 UTC], ["country_id", "6"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "country_id" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "asfsfgegerge"], ["country_id", 10], ["updated_at", 2017-08-29 14:36:29 UTC], ["id", 38]]